# DATA FILTERING

In [6]:
import pandas as pd

In [29]:
df=pd.read_csv("globaldata.csv")

df[df["aqi"]>100]
# df[(df["aqi"]>110) & (df["city"]=="New York")]

df[df["aqi"]>150][["city","aqi"]]

           city  aqi
3      New York  158
6      New York  155
19     New York  151
44     New York  156
53     New York  153
...         ...  ...
17822    Zurich  167
17885    Zurich  190
17886    Zurich  185
17888    Zurich  162
17993    Zurich  153

[847 rows x 2 columns]

In [34]:

new_data=df[df["aqi"]>150][["city","aqi"]].copy()

new_data.iloc[0]
# df.loc[0]

city    New York
aqi          158
Name: 3, dtype: object

In [1]:
df

In [9]:
dr=pd.read_csv("raw_data.csv")

In [10]:
dr

    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
1    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith   NaN  Canada   Female  62000.0
3    3          Alex   NaN     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female      NaN
5    5        Li Wei  27.0   China     Male  51000.0
6    6           NaN  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0     NaN     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA      NaN  58000.0